Revit 2027 API
ScheduleField.SheetColumnWidth Property
 The width of the column on a sheet, measured in feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SheetColumnWidth { get; set; }
Public Property SheetColumnWidth As Double
	Get
	Set
public:
property double SheetColumnWidth {
	double get ();
	void set (double value);
}
member SheetColumnWidth : float with get, set
Property Value
Double
 The width of the column.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: sheetColumnWidth is negative.
Remarks
In a schedule with an embedded ScheduleDefinition, a column may display two fields, one from each ScheduleDefinition. In that case, the larger of the two widths is used.
It is always aligned with the GridColumnWidth.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace